app/controllers/books_controller.rb

	def create
		@user = User.find(current_user.id)
		@book = current_user.books.new(book_params)
		@books = Book.all
		if @book.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "まま"], ["body", "パパ"], ["user_id", 1], ["created_at", "2020-06-26 09:42:12.998010"], ["updated_at", "2020-06-26 09:42:12.998010"]]

	def index
		@book_data = Book.ransack(params[:q])
		@books = @book_data.result(distinct: true).includes(:taggings,:user)
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 3]]
SELECT DISTINCT "books".* FROM "books"

	def search
    	@book = Book.search(search_params)
    	@books = @book.result(distinct: true).includes(:taggings,:user)
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 3]]
SELECT DISTINCT "books".* FROM "books"

	def show
		@user = Book.find(params[:id]).user
		@books = Book.all
		@book = Book.new
		@book_data = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]