app/controllers/users_controller.rb

  def index
    @user = User.find(current_user.id)
    @users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"